modules/budget/list/vm/atlas/chart.dot
digraph {
  edge [arrowhead="normal",color="white"]
  graph [layout="dot",bgcolor="#1c1c1c",rankdir="TB",ranksep="1.5"]
  node [shape="box",style="filled",fontcolor="white",color="transparent"]
  ":api:actual" [fillcolor="#160185"]
  ":budget:data" [fillcolor="#160185"]
  ":budget:list:vm" [fillcolor="#914141"]
  ":budget:model" [fillcolor="#160185"]
  ":codegen:annotation" [fillcolor="#160185"]
  ":core:di" [fillcolor="#a17103"]
  ":core:model" [fillcolor="#160185"]
  ":logging" [fillcolor="#160185"]
  ":prefs" [fillcolor="#160185"]
  ":api:actual" -> ":budget:model" [style="bold"]
  ":api:actual" -> ":codegen:annotation" [style="dashed"]
  ":api:actual" -> ":core:model" [style="bold"]
  ":budget:data" -> ":budget:model" [style="bold"]
  ":budget:data" -> ":core:model" [style="bold"]
  ":budget:data" -> ":logging" [style="dashed"]
  ":budget:list:vm" -> ":api:actual" [style="dashed"]
  ":budget:list:vm" -> ":budget:model" [style="bold"]
  ":budget:list:vm" -> ":core:di" [style="bold"]
  ":budget:list:vm" -> ":core:model" [style="bold"]
  ":budget:list:vm" -> ":logging" [style="dashed"]
  ":budget:list:vm" -> ":prefs" [style="dashed"]
  ":core:di" -> ":budget:data" [style="bold"]
  ":core:di" -> ":budget:model" [style="bold"]
  ":prefs" -> ":core:model" [style="bold"]
}
